homework/cosc480-hw3-cmking54/app/controllers/rental_properties_controller.rb

    def index
        location # also may not work
        #@properties = RentalProperty.all
        case params[:sort]
        when 'title','maxpersons', 'price'
            @properties = RentalProperty.order(params[:sort].to_sym)
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE (rental_properties.lat IS NOT NULL AND rental_properties.lng IS NOT NULL) ORDER BY

    def show
        @property = RentalProperty.find(params[:id])
---
SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]