homework/cosc480-hw4-cmking54/app/controllers/rental_properties_controller.rb

SELECT "rental_properties".* FROM "rental_properties" WHERE (rental_properties.lat IS NOT NULL AND rental_properties.lng IS NOT NULL) AND (rental_properties.lat>42.68244374714642 AND rental_properties.lat<42.97158345285359 AND rental_properties.lng>-75.74174369086776 AND rental_properties.lng<-75.34750390913221) AND ((
---
  def index
    @location = get_location
    #params[:constraints] || {}
    #byebug
    session[:constraints] = params[:constraints]
    @properties = RentalProperty.filter_on_constraints(session[:constraints] || {}, @location)
    session[:order] = params[:order]
    order = session[:order] || :distance
    if order.to_sym != :distance
        @properties = @properties.order(order)

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @location = get_location
    @property = RentalProperty.find(params[:id])

INSERT INTO "rental_properties" ("title", "description", "pets_allowed", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["pets_allowed", "f"], ["address", ""], ["created_at", "2018-03-08 02:48:18.602128"], ["updated_at", "2018-03-08 02:48:18.602128"]]
---
    def create
        session[:rental_property] = params[:rental_property]
        geo = Geokit::Geocoders::MultiGeocoder.geocode(session[:rental_property][:address])
        if !geo.success
            flash[:warning] = "Rental property not created due to bad address entered"
            redirect_to new_rental_property_path and return
        end
        p = RentalProperty.new(create_update_params) # "mass assignment" of attributes!
        p.lat, p.lng = geo.lat, geo.lng
        if p.save

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def edit
        @property = RentalProperty.find(params[:id])

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "rental_properties" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "rental_properties"."id" = ?  [["image_file_name", "dog_wall_cropped.png"], ["image_updated_at", "2018-03-09 23:06:03.546323"], ["updated_at", "2018-03-09 23:06:06.206888"], ["id", 11]]
---
    def update
        session[:rental_property] = params[:rental_property]
        geo = Geokit::Geocoders::MultiGeocoder.geocode(session[:rental_property][:address])
        if !geo.success
            flash[:warning] = "Rental property not updated due to bad address entered"
            redirect_to edit_rental_property_path and return
        end
        p = RentalProperty.find(params[:id]) # get existing object
        p.lat, p.lng = geo.lat, geo.lng
        if p.update(create_update_params) # update the object with mass assignment

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "rental_properties" WHERE "rental_properties"."id" = ?  [["id", 1]]
---
    def destroy
        @property = RentalProperty.find(params[:id])
        @property.destroy