labs/cosc480-lab6-cmking54/app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    begin
        @product = Product.find(id)