labs/cosc480-lab6-cmking54/app/views/products/show.html.haml


    - @product.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]

        %td.reviewtext= review.review
        - first, last = review.customer.first, review.customer.last
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]