proj/new_sus/sustainability-office/app/controllers/meetings_controller.rb

  def index
    WebAdder.load_events
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"