proj/new_sus/sustainability-office/app/controllers/registrations_controller.rb

  def new
    @meeting = Meeting.find(params[:meeting_id])
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]