labs/cosc480-lab8-cmking54/app/controllers/comments_controller.rb

  def create
    begin
        @sight = Sight.find(params[:id])
---
SELECT  "sights".* FROM "sights" WHERE "sights"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]