homework/cosc480-hw5-cmking54/app/controllers/rental_properties_controller.rb

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @location = get_location
    @property = RentalProperty.find(params[:id])

INSERT INTO "rental_properties" ("title", "description", "bedrooms", "beds", "maxpersons", "bathrooms", "pets_allowed", "address", "price", "lat", "lng", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    p = RentalProperty.new(create_update_params)
    geo=Geokit::Geocoders::MultiGeocoder.geocode(p.address)
    if geo.success
      p.lat, p.lng = geo.lat, geo.lng
      if p.save

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    id = params[:id]
    @property = RentalProperty.find(id)

SELECT  "rental_properties".* FROM "rental_properties" WHERE "rental_properties"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "rental_properties" SET "description" = ?, "price" = ?, "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "rental_properties"."id" = ?
---
  def update
    id = params[:id]
    p = RentalProperty.find(id)
    oldaddress = p.address
    p.update(create_update_params)