proj/sustainability-office/app/controllers/meetings_controller.rb

  def index
    WebAdder.load_events
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def show
    id = params[:id]
    @meeting = Meeting.find(id)
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    id = params[:id]
    @meeting = Meeting.find(id)
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @meeting = Meeting.find(params[:id])
    @meeting.destroy
---
SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 1]]