labs/cosc480-lab7-cmking54/app/controllers/sights_controller.rb

SELECT  "sights".* FROM "sights" WHERE "sights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      @sight = Sight.find(params[:id])